<!DOCTYPE html>
<html lang="en">
<head>
	<meta charset="UTF-8">
	<title>Document</title>
</head>
<body>
	<h1>3.赋值运算符</h1>
	<?php
	//赋值运算符是一个二元运算符，它左边的操作数必须是变量，右边可以是一个表达式。
	//它把右边的表达式的值赋给左边变量，或者说是将原表达式的值复制到新变量中。
	// =   +=   -=  /=  %= *=  .=(将变量与复制的值连接后的结果在赋给变量)
	
	$a = $b = $c = $d = 100;

	$a += 10;
	$b -= 10;
	$c /= 10;
	$d %= 10;

	$resule = "结果是；";

	$resule .= "\$a自加10以后的值为：${a},";
	$resule .= "\$b自减10以后的值为：${b},";
	$resule .= "\$c自除10以后的值为：${c},";
	$resule .= "\$d自取余10以后的值为：${d},";


	echo $resule;

	//结果是；$a自加10以后的值为：110,$b自减10以后的值为：90,$c自除10以后的值为：10,$d自取余10以后的值为：0,
	?>
</body>
</html>