<?php 
echo "<h1>5个字一行输出</h1>";
for($i=1,$j=0;$i<=100;$i++){
	if($i%2==0){
		echo $i;
		$j=$j+1;
	  if($j%5==0){
		echo "<br>";
	}
	}
	
}



echo "<h1>能被三整除的数</h1>";
for($i=1;$i<100;$i++){
	if($i%3 == 0){
		echo $i,"<br>";
	}
}



echo "<h1>能被三整除的数不带6</h1>";
for($i = 1;$i<=9;$i++){
	for($j = 0;$j<=9;$j++){
		if($i%6!=0 && $j%6!=0 &&($j*10+$i)%3==0 ){
			echo $j*10+$i,"<br>";
		}
	}
}




echo "<h1>算算多少人</h1>";
for($i=100;$i<200;$i++){
	if($i%3==1 && $i%4==2 && $i%5==3){
		echo "一共",$i,"人<br>";
	}
}



echo "<h1>除数与被除数</h1>";
for($a=1;$a<163;$a++){
	if($a*3+10 + 3 + 10 + $a == 163){

		echo "被除数是",$a*3+10,"除数是",$a,"<br>";
	}
}



echo "<h1>猴子搬香蕉问题</h1>";
for($bo=100,$m=1;$m<=50;$m++){
	if($bo>50){
		$bo = $bo -3 ;

	}else{
		$bo = $bo -1;
	}
	echo "走了" , $m ,"米, 还剩",$bo,"根香蕉<br>";
}



echo "<h1>0-299不含四的数</h1>";
for($x=0;$x<3;$x++){
	for($y=0;$y<=9;$y++){
		for($z=0;$z<=9;$z++){
			if($x!=4 && $y!=4 && $z!=4){
				echo $x*100+$y*10+$z,'<br>';
			}
		}
	}
}



echo "<h1>水仙花数</h1>";
for($b=1;$b<=9;$b++){
	for($s=0;$s<=9;$s++){
		for($g=0;$g<=9;$g++){
			if($s*10+$b*100+$g  ==  $b*$b*$b+$s*$s*$s+$g*$g*$g){
				echo "水仙花数是",$b*100+$s*10+$g,'<br>';
			}
		}
	}
}



echo "<h1>五行四列的表格</h1>";
echo "<table border=1>";
for($i=1;$i<=5;$i++){
	echo "<tr>";
	for($j=1;$j<=4;$j++){
		echo "<td>";
		echo $i,"+",$j;
		echo "</td>";
	}
	echo "</tr>";
}
echo "</table>";



echo "<h1>过桥问题</h1>";

for($i=1,$m=100000;$m>=5000;$i++){
	if($m>50000){
		$m = $m -$m*0.05;
	}else if($m>=5000){
		$m = $m - 5000;
	}
	echo "经过了",$i,"次路口,还剩",$m,"<br>";
}



echo "<h1>九九乘法表</h1>";

for($i=1;$i<=9;$i++){
	for($j=1;$j<=$i;$j++){
		echo $i ,'*', $j ,"=",$i*$j," ";
	}
	echo "<br>";
}



echo "<h1>百钱买百鸡</h1>";

for($g=1;$g<=20;$g++){
	for($m=1;$m<=34;$m++){
		if($g*5+$m*3+(100-$g-$m)/3 == 100){
			echo "买",$g,"只公鸡",$m, " 只母鸡",100-$g-$m, "只小鸡<br>";
		}
	}
}
echo "<br>";

 ?>